zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_tim_ex.h
#define TIM_TIM3_ETR_GPIO        0x00000000U                                                 /* !< TIM3_ETR is
                                                                                              connected to GPIO */
#define TIM_TIM3_ETR_ETH1_PPS    (TIM3_AF1_ETRSEL_2 | TIM3_AF1_ETRSEL_1)                     /* !< TIM3_ETR is
                                                                                              connected to ETH1 PPS */
#define TIM_TIM3_ETR_ETH2_PPS    (TIM3_AF1_ETRSEL_2 | TIM3_AF1_ETRSEL_1 | TIM3_AF1_ETRSEL_0) /* !< TIM3_ETR is
                                                                                              connected to ETH2 PPS */

#define TIM_TIM4_ETR_GPIO        0x00000000U                                                 /* !< TIM4_ETR is
                                                                                              connected to GPIO */

#define TIM_TIM5_ETR_GPIO        0x00000000U                                                 /* !< TIM5_ETR is
                                                                                              connected to GPIO */
#define TIM_TIM5_ETR_SAI2_FSA    TIM5_AF1_ETRSEL_0                                           /* !< TIM5_ETR is
                                                                                              connected to SAI2 FS_A */
#define TIM_TIM5_ETR_SAI2_FSB    TIM5_AF1_ETRSEL_1                                           /* !< TIM5_ETR is
                                                                                              connected to SAI2 FS_B */
#define TIM_TIM5_ETR_OTG_SOF     (TIM5_AF1_ETRSEL_1 | TIM5_AF1_ETRSEL_0)                     /* !< TIM5_ETR is
                                                                                              connected to OTG SOF */
/**
  * @}
  */

/** @defgroup TIMEx_Break_Input TIM Extended Break input
  * @{
  */
#define TIM_BREAKINPUT_BRK     0x00000001U                                      /*!< Timer break input  */
#define TIM_BREAKINPUT_BRK2    0x00000002U                                      /*!< Timer break2 input */
/**
  * @}
  */

/** @defgroup TIMEx_Break_Input_Source TIM Extended Break input source
  * @{
  */
#define TIM_BREAKINPUTSOURCE_BKIN     0x00000001U                               /*!< An external source (GPIO) is connected to the BKIN pin  */
#define TIM_BREAKINPUTSOURCE_DFSDM1   0x00000008U                               /*!< The analog watchdog output of the DFSDM1 peripheral is connected to the break input */
/**
  * @}
  */

/** @defgroup TIMEx_Break_Input_Source_Enable TIM Extended Break input source enabling
  * @{
  */
#define TIM_BREAKINPUTSOURCE_DISABLE     0x00000000U                            /*!< Break input source is disabled */
#define TIM_BREAKINPUTSOURCE_ENABLE      0x00000001U                            /*!< Break input source is enabled */
/**
  * @}
  */

/** @defgroup TIMEx_Break_Input_Source_Polarity TIM Extended Break input polarity
  * @{
  */
#define TIM_BREAKINPUTSOURCE_POLARITY_LOW     0x00000001U                       /*!< Break input source is active low */
#define TIM_BREAKINPUTSOURCE_POLARITY_HIGH    0x00000000U                       /*!< Break input source is active_high */
/**
  * @}
  */

/** @defgroup TIMEx_Timer_Input_Selection TIM Extended Timer input selection
  * @{
  */

#define TIM_TIM1_TI1_GPIO                          0x00000000UL                              /*!< TIM1_TI1 is connected to GPIO */
#define TIM_TIM1_TI2_GPIO                          0x00000000UL                              /*!< TIM1_TI2 is connected to GPIO */
#define TIM_TIM1_TI3_GPIO                          0x00000000UL                              /*!< TIM1_TI3 is connected to GPIO */
#define TIM_TIM1_TI4_GPIO                          0x00000000UL                              /*!< TIM1_TI4 is connected to GPIO */

#define TIM_TIM8_TI1_GPIO                          0x00000000UL                              /*!< TIM8_TI1 is connected to GPIO */
#define TIM_TIM8_TI2_GPIO                          0x00000000UL                              /*!< TIM8_TI2 is connected to GPIO */
#define TIM_TIM8_TI3_GPIO                          0x00000000UL                              /*!< TIM8_TI3 is connected to GPIO */
#define TIM_TIM8_TI4_GPIO                          0x00000000UL                              /*!< TIM8_TI4 is connected to GPIO */

#define TIM_TIM2_TI1_GPIO                          0x00000000UL                              /*!< TIM2_TI1 is connected to GPIO */
#define TIM_TIM2_TI2_GPIO                          0x00000000UL                              /*!< TIM2_TI2 is connected to GPIO */
#define TIM_TIM2_TI3_GPIO                          0x00000000UL                              /*!< TIM2_TI3 is connected to GPIO */
#define TIM_TIM2_TI4_GPIO                          0x00000000UL                              /*!< TIM2_TI4 is connected to GPIO */

#define TIM_TIM3_TI1_GPIO                          0x00000000UL                              /*!< TIM3_TI1 is connected to GPIO */
#define TIM_TIM3_TI2_GPIO                          0x00000000UL                              /*!< TIM3_TI2 is connected to GPIO */
#define TIM_TIM3_TI3_GPIO                          0x00000000UL                              /*!< TIM3_TI3 is connected to GPIO */
#define TIM_TIM3_TI4_GPIO                          0x00000000UL                              /*!< TIM3_TI4 is connected to GPIO */

#define TIM_TIM4_TI1_GPIO                          0x00000000UL                              /*!< TIM4_TI1 is connected to GPIO */
#define TIM_TIM4_TI2_GPIO                          0x00000000UL                              /*!< TIM4_TI2 is connected to GPIO */
#define TIM_TIM4_TI3_GPIO                          0x00000000UL                              /*!< TIM4_TI3 is connected to GPIO */
#define TIM_TIM4_TI4_GPIO                          0x00000000UL                              /*!< TIM4_TI4 is connected to GPIO */

#define TIM_TIM5_TI1_GPIO                          0x00000000U                               /*!< TIM5_TI1 is connected to GPIO */
#define TIM_TIM5_TI1_FDCAN_TMP                     TIM_TISEL_TI1SEL_0                        /*!< TIM5_TI1 is connected to FDCAN TMP */
#define TIM_TIM5_TI1_FDCAN_RTP                     TIM_TISEL_TI1SEL_1                        /*!< TIM5_TI1 is connected to FDCAN RTP */
#define TIM_TIM5_TI2_GPIO                          0x00000000UL                              /*!< TIM5_TI2 is connected to GPIO */
#define TIM_TIM5_TI3_GPIO                          0x00000000UL                              /*!< TIM5_TI3 is connected to GPIO */
#define TIM_TIM5_TI4_GPIO                          0x00000000UL                              /*!< TIM5_TI4 is connected to GPIO */

